import time
import random
from pynput.keyboard import Key, Controller

span = 0.05  # 超快速度，50毫秒间隔
sentences = [
	"流浪你好像肠胃不好上厕所把脑袋拉出去了",
	"流浪你是不是阿基米德的后人啊整天就知道抬杠",
	"流浪看你这么没素质你的学历是胎教吧",
	"流浪还装啥嫩呢脸上皱纹能把苍蝇夹死",
	"流浪我有洁癖正好你是垃圾",
	"流浪你的智商跟你的余额一样感人",
	"流浪你脖子上顶的是肿瘤吗",
	"流浪听说你认二郎神当主人了",
	"流浪上帝把智慧洒满人间唯独给你撑了把伞",
	"流浪作为失败的典型你真是太成功了",
	"流浪你牛逼你第一你在海里开飞机",
	"流浪祝你寿比昙花福如加勒比海",
	"流浪你可真是上帝造人的草稿",
	"流浪你的戏可以像你的钱一样少吗",
	"流浪天晴了雨停了你又觉得你行了",
	"流浪你要是鲜花牛都不敢拉粪了",
	"流浪头发乱的像海带脑袋顶个锅盖还硬说自己穿的有现代气息",
	"流浪就算经济危机了你也贵不了",
	"流浪如果吃鱼可以让人变聪明的话那你之前得包一个海洋的鱼",
	"流浪你复杂的五官掩饰不了你朴素的智商",
	"流浪你活着浪费空气死了浪费土地",
	"流浪别别别我哪敢碰你啊你以为洗手液很便宜吗",
	"流浪你为什么不找个安静的地方自个儿数数脑细胞去",
	"流浪如果没有你的存在怎么能衬托世界的美丽",
	"流浪长的丑不是你的错但是出来吓人就是你的不对了",
	"流浪你这破智商绝对适合晚上数月亮白天数太阳",
	"流浪你骂我你完了你一年连不上WiFi",
	"流浪这孩子或许能用来给猪配种",
	"流浪你最美你最棒我家母猪没你浪",
	"流浪脑子是个日用品希望你不要把它当做装饰品",
	"流浪佩琪牌手电筒照亮你的丑",
	"流浪你算哪瓣蒜",
	"流浪你是没长脑子还是脑子长了霉呀",
	"流浪国家怎么不拿你的脸皮来研究防弹衣呢",
	"流浪你是不是皮卡丘的弟弟皮在痒",
	"流浪你是一盘土豆丝又土又逗又屌丝",
	"流浪你是一瓶二锅头又二又坏又上头",
	"流浪药药切克闹我说孙子你说到",
	"流浪你是敦煌来的吗壁画这么多",
	"流浪人家减肥减腰减屁股为什么你非要从脑细胞开始",
	"流浪想把我36码的鞋印在你42码的脸上",
	"流浪如果一定要拿你和猪比我认为你最少有两点和它不同一你比它能吃二它比你聪明",
	"流浪你是一条酸菜鱼又酸又菜又多余",
	"流浪中国那么多兵器你不学偏学剑",
	"流浪你怎么长的跟二维码似的不扫一下都不知道你是什么东西",
	"流浪你一辈子都在做蠢事还是蛮有毅力的",
	"流浪世界这么大能认识你我觉得自己好不幸",
	"流浪现在都实行垃圾分类了你自觉点去你该去的垃圾桶好吗",
	"流浪拿你当人的时候你尽量装的像点",
	"流浪你王者打多了脑子里也有个峡谷",
	"流浪您是不是把敌敌畏当可乐把您那八毛钱十二斤的脑子给喝绣到了",
	"流浪妹妹的腮红有点淡要不要姐姐用巴掌给你补补",
	"流浪别再用聪明的样子来伪装自己它会水土不服的",
	"流浪百度搜不到你搜狗绝对有你",
	"流浪自从得了神经病你整个人精神多了",
	"流浪你这脑容量还不如你耳屎多",
	"流浪是金子总会发光的但你这玻璃渣子只会反光",
	"流浪你一出门千山鸟飞绝万径人踪灭",
	"流浪你天生属黄花欠拍后天属核桃欠锤",
	"流浪你是什么牌子的塑料袋这么能装",
]
kb = Controller()
time.sleep(1)  # 减少初始等待时间
flag = True
while flag:
	# 随机打字
	sentence = random.choice(sentences)
	kb.type(sentence)
	kb.press(Key.enter)
	kb.release(Key.enter)
	time.sleep(span)
